In [48]:
import pandas as pd
from faker import Faker
import random

In [49]:
fake = Faker()

In [53]:
dict1 = {
    "ids" : [x for x in range(10)],
    "names" : [fake.name() for _ in range(10)],
    "emails" : [fake.email() for _ in range(10)],
    "address": [fake.address() for _ in range(10)],
    "country" : [fake.country() for _ in range(10)],
    "salary": [random.randint(10000, 100000) for _ in range(10)]
}

In [54]:
df = pd.DataFrame(dict1)

In [55]:
df

,ids,names,emails,address,country,salary
0,0,Christopher Hernandez,zmiller@example.org,"0546 Christina Circles\nSouth Stephaniehaven, ...",Timor-Leste,98382
1,1,Jessica Hughes,cristina79@example.org,"2214 Benson Club Apt. 223\nVaughnbury, LA 60442",Holy See (Vatican City State),99173
2,2,James Richards,christophersnyder@example.com,USS Olson\nFPO AA 95554,Korea,23315
3,3,Brian Gilbert,smithcharles@example.net,"2802 Jade Fort Suite 012\nSouth Patriciaberg, ...",Samoa,35758
4,4,Cody Osborne,angelafox@example.org,"90127 Dawn Canyon Suite 865\nRobertfurt, AZ 47060",Benin,56200
5,5,Carolyn Wong,jennifer94@example.com,"976 Berry Bridge\nSouth Hunterland, MI 37592",France,47990
6,6,Shirley Smith,markramos@example.org,"8624 Paul Vista Suite 410\nAnnehaven, KY 23965",Philippines,48655
7,7,Mary Craig,nicholasoneal@example.org,"65546 Friedman Pines Apt. 174\nMichaelville, M...",Solomon Islands,39614
8,8,Christina Huber,hallkristin@example.org,"63870 Shields Flat\nAdamshire, AS 87115",Bolivia,24453
9,9,Christopher Warner,travis84@example.net,"20412 Williams Passage\nMoodymouth, MT 92595",Romania,21715

In [56]:
## rows, columns 
df.shape

(10, 6)

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ids      10 non-null     int64
 1   names    10 non-null     object
 2   emails   10 non-null     object
 3   address  10 non-null     object
 4   country  10 non-null     object
 5   salary   10 non-null     int64
dtypes: int64(2), object(4)
memory usage: 612.0+ bytes

In [60]:
## describe: statisticall / numerical columns
df.describe()

            ids        salary
count  10.00000     10.000000
mean    4.50000  49525.500000
std     3.02765  28433.787989
min     0.00000  21715.000000
25%     2.25000  27279.250000
50%     4.50000  43802.000000
75%     6.75000  54313.750000
max     9.00000  99173.000000

In [61]:
df.shape
print(f"Number of rows present {df.shape[0]}")
print(f"Number of columns present {df.shape[1]}")

Number of rows present 10
Number of columns present 6

In [62]:
rows, columns = df.shape

In [67]:
df.head()

,ids,names,emails,address,country,salary
0,0,Christopher Hernandez,zmiller@example.org,"0546 Christina Circles\nSouth Stephaniehaven, ...",Timor-Leste,98382
1,1,Jessica Hughes,cristina79@example.org,"2214 Benson Club Apt. 223\nVaughnbury, LA 60442",Holy See (Vatican City State),99173
2,2,James Richards,christophersnyder@example.com,USS Olson\nFPO AA 95554,Korea,23315
3,3,Brian Gilbert,smithcharles@example.net,"2802 Jade Fort Suite 012\nSouth Patriciaberg, ...",Samoa,35758
4,4,Cody Osborne,angelafox@example.org,"90127 Dawn Canyon Suite 865\nRobertfurt, AZ 47060",Benin,56200

In [68]:
df.head(3)

,ids,names,emails,address,country,salary
0,0,Christopher Hernandez,zmiller@example.org,"0546 Christina Circles\nSouth Stephaniehaven, ...",Timor-Leste,98382
1,1,Jessica Hughes,cristina79@example.org,"2214 Benson Club Apt. 223\nVaughnbury, LA 60442",Holy See (Vatican City State),99173
2,2,James Richards,christophersnyder@example.com,USS Olson\nFPO AA 95554,Korea,23315

In [69]:
df.tail()

,ids,names,emails,address,country,salary
5,5,Carolyn Wong,jennifer94@example.com,"976 Berry Bridge\nSouth Hunterland, MI 37592",France,47990
6,6,Shirley Smith,markramos@example.org,"8624 Paul Vista Suite 410\nAnnehaven, KY 23965",Philippines,48655
7,7,Mary Craig,nicholasoneal@example.org,"65546 Friedman Pines Apt. 174\nMichaelville, M...",Solomon Islands,39614
8,8,Christina Huber,hallkristin@example.org,"63870 Shields Flat\nAdamshire, AS 87115",Bolivia,24453
9,9,Christopher Warner,travis84@example.net,"20412 Williams Passage\nMoodymouth, MT 92595",Romania,21715

In [70]:
df.tail(3)

,ids,names,emails,address,country,salary
7,7,Mary Craig,nicholasoneal@example.org,"65546 Friedman Pines Apt. 174\nMichaelville, M...",Solomon Islands,39614
8,8,Christina Huber,hallkristin@example.org,"63870 Shields Flat\nAdamshire, AS 87115",Bolivia,24453
9,9,Christopher Warner,travis84@example.net,"20412 Williams Passage\nMoodymouth, MT 92595",Romania,21715

In [72]:
df.sort_values(by="salary", ascending=True)

,ids,names,emails,address,country,salary
9,9,Christopher Warner,travis84@example.net,"20412 Williams Passage\nMoodymouth, MT 92595",Romania,21715
2,2,James Richards,christophersnyder@example.com,USS Olson\nFPO AA 95554,Korea,23315
8,8,Christina Huber,hallkristin@example.org,"63870 Shields Flat\nAdamshire, AS 87115",Bolivia,24453
3,3,Brian Gilbert,smithcharles@example.net,"2802 Jade Fort Suite 012\nSouth Patriciaberg, ...",Samoa,35758
7,7,Mary Craig,nicholasoneal@example.org,"65546 Friedman Pines Apt. 174\nMichaelville, M...",Solomon Islands,39614
5,5,Carolyn Wong,jennifer94@example.com,"976 Berry Bridge\nSouth Hunterland, MI 37592",France,47990
6,6,Shirley Smith,markramos@example.org,"8624 Paul Vista Suite 410\nAnnehaven, KY 23965",Philippines,48655
4,4,Cody Osborne,angelafox@example.org,"90127 Dawn Canyon Suite 865\nRobertfurt, AZ 47060",Benin,56200
0,0,Christopher Hernandez,zmiller@example.org,"0546 Christina Circles\nSouth Stephaniehaven, ...",Timor-Leste,98382
1,1,Jessica Hughes,cristina79@example.org,"2214 Benson Club Apt. 223\nVaughnbury, LA 60442",Holy See (Vatican City State),99173

In [73]:
## read csv
df1 = pd.read_csv(r"D:\Data Science\SplashBI_Migration_Automation\Data\neo_data.csv")
df1.head()

,id,name,absolute_magnitude_h,min_diameter_km,max_diameter_km,close_approach_date,close_approach_date_full,epoch_date_close_approach,relative_velocity_kps,miss_distance_km,orbiting_body,is_potentially_hazardous,is_sentry_object,nasa_jpl_url
0,2085990,85990 (1999 JV6),20.27,0.234723,0.524856,2015-01-05,2015-Jan-05 11:16,1420456560000,7.694743,1.246329e+07,Earth,True,False,https://ssd.jpl.nasa.gov/tools/sbdb_lookup.htm...
1,2523915,523915 (1997 VM4),18.57,0.513517,1.148259,2015-01-05,2015-Jan-05 11:56,1420458960000,16.169622,5.815821e+07,Earth,False,False,https://ssd.jpl.nasa.gov/tools/sbdb_lookup.htm...
2,3263533,(2004 XG29),25.66,0.019613,0.043857,2015-01-05,2015-Jan-05 08:03,1420444980000,12.530123,3.492914e+07,Earth,False,False,https://ssd.jpl.nasa.gov/tools/sbdb_lookup.htm...
3,3426635,(2008 RU),22.40,0.088015,0.196807,2015-01-05,2015-Jan-05 08:11,1420445460000,12.595836,2.459521e+07,Earth,False,False,https://ssd.jpl.nasa.gov/tools/sbdb_lookup.htm...
4,3601924,(2012 FO52),22.63,0.079169,0.177027,2015-01-05,2015-Jan-05 19:45,1420487100000,15.775064,5.554271e+07,Earth,False,False,https://ssd.jpl.nasa.gov/tools/sbdb_lookup.htm...

In [76]:
## read excel
pd.set_option("display.max_columns", None)
df = pd.read_excel(r"D:\Data Science\SplashBI_Migration_Automation\Data\Copy_of_Summary_Receipts_by_Customer.xlsx", sheet_name="Data")
df.head()

,Customer Name,Customer Number,Receipt Number,Receipt Date,Type,Receipt Status,Currency Code,Functional Amount,Amount,Net Amount,Customer Receipt Reference,Payment Type Code,Receipt Class Dsp,Location,Customer Bank Name,Customer Bank Account,Customer Bank Account Num,Customer Bank Branch,Batch Name,State,Posted Date,Gl Posted Date,Activity,Tax Code Source,Operating Unit
0,World of Business,1000,1009879,1998-10-01,CASH,REV,USD,880801.75,880801.75,880801.75,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1998-10-31,1998-10-31,NaN,NaN,Vision Operations
1,World of Business,1000,1011118,1998-04-01,CASH,REV,USD,12000000.00,12000000.00,12000000.00,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1999-09-30,1999-09-30,NaN,NaN,Vision Operations
2,World of Business,1000,1011627,1998-06-27,CASH,APP,USD,2000000.00,2000000.00,2000000.00,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,CLEARED,1998-06-01,1998-06-01,NaN,NaN,Vision Operations
3,World of Business,1000,1013500,1998-11-04,CASH,REV,USD,1742.91,1742.91,1742.91,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1998-11-30,1998-11-30,NaN,NaN,Vision Operations
4,World of Business,1000,102222,1997-12-21,CASH,REV,DEM,4062.50,6500.00,6500.00,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1999-09-30,1999-09-30,NaN,NaN,Vision Operations

In [78]:
## getting null values with respect to the columns
df.isnull().sum()

Customer Name                 0
Customer Number               0
Receipt Number                0
Receipt Date                  0
Type                          0
Receipt Status                0
Currency Code                 0
Functional Amount             0
Amount                        0
Net Amount                    0
Customer Receipt Reference    7
Payment Type Code             7
Receipt Class Dsp             0
Location                      0
Customer Bank Name            7
Customer Bank Account         7
Customer Bank Account Num     7
Customer Bank Branch          7
Batch Name                    6
State                         0
Posted Date                   0
Gl Posted Date                0
Activity                      7
Tax Code Source               7
Operating Unit                0
dtype: int64

In [80]:
df.shape

(7, 25)

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Customer Name               7 non-null      object
 1   Customer Number             7 non-null      int64
 2   Receipt Number              7 non-null      int64
 3   Receipt Date                7 non-null      datetime64[ns]
 4   Type                        7 non-null      object
 5   Receipt Status              7 non-null      object
 6   Currency Code               7 non-null      object
 7   Functional Amount           7 non-null      float64
 8   Amount                      7 non-null      float64
 9   Net Amount                  7 non-null      float64
 10  Customer Receipt Reference  0 non-null      float64
 11  Payment Type Code           0 non-null      float64
 12  Receipt Class Dsp           7 non-null      object
 13  Location                    7 non-null      object
 14  Customer Bank Name          0 non-null      float64
 15  Customer Bank Account       0 non-null      float64
 16  Customer Bank Account Num   0 non-null      float64
 17  Customer Bank Branch        0 non-null      float64
 18  Batch Name                  1 non-null      float64
 19  State                       7 non-null      object
 20  Posted Date                 7 non-null      datetime64[ns]
 21  Gl Posted Date              7 non-null      datetime64[ns]
 22  Activity                    0 non-null      float64
 23  Tax Code Source             0 non-null      float64
 24  Operating Unit              7 non-null      object
dtypes: datetime64[ns](3), float64(12), int64(2), object(8)
memory usage: 1.5+ KB

In [87]:
## know the columns data type
df['Net Amount'].dtype

dtype('float64')

In [89]:
## getting all the columns
df.columns.tolist()

['Customer Name',
 'Customer Number',
 'Receipt Number',
 'Receipt Date',
 'Type',
 'Receipt Status',
 'Currency Code',
 'Functional Amount',
 'Amount',
 'Net Amount',
 'Customer Receipt Reference',
 'Payment Type Code',
 'Receipt Class Dsp',
 'Location',
 'Customer Bank Name',
 'Customer Bank Account',
 'Customer Bank Account Num',
 'Customer Bank Branch',
 'Batch Name',
 'State',
 'Posted Date',
 'Gl Posted Date',
 'Activity',
 'Tax Code Source',
 'Operating Unit']

In [96]:
## separating numerical columns and categorical columns
num_col = [x for x in df.columns if df[x].dtypes in ['float64', 'int64', 'int32']]
num_col

['Customer Number',
 'Receipt Number',
 'Functional Amount',
 'Amount',
 'Net Amount',
 'Customer Receipt Reference',
 'Payment Type Code',
 'Customer Bank Name',
 'Customer Bank Account',
 'Customer Bank Account Num',
 'Customer Bank Branch',
 'Batch Name',
 'Activity',
 'Tax Code Source']

In [93]:
cat_col = [x for x in df.columns if df[x].dtypes in ['object']]
cat_col

['Customer Name',
 'Type',
 'Receipt Status',
 'Currency Code',
 'Receipt Class Dsp',
 'Location',
 'State',
 'Operating Unit']

In [94]:
df[num_col]

,Customer Number,Receipt Number,Functional Amount,Amount,Net Amount,Customer Receipt Reference,Payment Type Code,Customer Bank Name,Customer Bank Account,Customer Bank Account Num,Customer Bank Branch,Batch Name,Activity,Tax Code Source
0,1000,1009879,880801.75,880801.75,880801.75,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1000,1011118,12000000.00,12000000.00,12000000.00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1000,1011627,2000000.00,2000000.00,2000000.00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1000,1013500,1742.91,1742.91,1742.91,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1000,102222,4062.50,6500.00,6500.00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,1000,12,5000.00,5000.00,5000.00,NaN,NaN,NaN,NaN,NaN,NaN,900001.0,NaN,NaN
6,1000,893745987,6250.00,10000.00,10000.00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [95]:
df[cat_col]

,Customer Name,Type,Receipt Status,Currency Code,Receipt Class Dsp,Location,State,Operating Unit
0,World of Business,CASH,REV,USD,Manual Receipts - BofA,San Jose (OPS),REVERSED,Vision Operations
1,World of Business,CASH,REV,USD,Manual Receipts - BofA,San Jose (OPS),REVERSED,Vision Operations
2,World of Business,CASH,APP,USD,Manual Receipts - BofA,San Jose (OPS),CLEARED,Vision Operations
3,World of Business,CASH,REV,USD,Manual Receipts - BofA,San Jose (OPS),REVERSED,Vision Operations
4,World of Business,CASH,REV,DEM,Manual Receipts - BofA,San Jose (OPS),REVERSED,Vision Operations
5,World of Business,CASH,REV,USD,Manual Receipts - BofA,San Jose (OPS),REVERSED,Vision Operations
6,World of Business,CASH,REV,DEM,Manual Receipts - BofA,San Jose (OPS),REVERSED,Vision Operations

In [98]:
df[num_col].describe()

,Customer Number,Receipt Number,Functional Amount,Amount,Net Amount,Customer Receipt Reference,Payment Type Code,Customer Bank Name,Customer Bank Account,Customer Bank Account Num,Customer Bank Branch,Batch Name,Activity,Tax Code Source
count,7.0,7.000000e+00,7.000000e+00,7.000000e+00,7.000000e+00,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
mean,1000.0,1.282706e+08,2.128265e+06,2.129149e+06,2.129149e+06,NaN,NaN,NaN,NaN,NaN,NaN,900001.0,NaN,NaN
std,0.0,3.375432e+08,4.417188e+06,4.416693e+06,4.416693e+06,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,1000.0,1.200000e+01,1.742910e+03,1.742910e+03,1.742910e+03,NaN,NaN,NaN,NaN,NaN,NaN,900001.0,NaN,NaN
25%,1000.0,5.560505e+05,4.531250e+03,5.750000e+03,5.750000e+03,NaN,NaN,NaN,NaN,NaN,NaN,900001.0,NaN,NaN
50%,1000.0,1.011118e+06,6.250000e+03,1.000000e+04,1.000000e+04,NaN,NaN,NaN,NaN,NaN,NaN,900001.0,NaN,NaN
75%,1000.0,1.012564e+06,1.440401e+06,1.440401e+06,1.440401e+06,NaN,NaN,NaN,NaN,NaN,NaN,900001.0,NaN,NaN
max,1000.0,8.937460e+08,1.200000e+07,1.200000e+07,1.200000e+07,NaN,NaN,NaN,NaN,NaN,NaN,900001.0,NaN,NaN

In [100]:
df

,Customer Name,Customer Number,Receipt Number,Receipt Date,Type,Receipt Status,Currency Code,Functional Amount,Amount,Net Amount,Customer Receipt Reference,Payment Type Code,Receipt Class Dsp,Location,Customer Bank Name,Customer Bank Account,Customer Bank Account Num,Customer Bank Branch,Batch Name,State,Posted Date,Gl Posted Date,Activity,Tax Code Source,Operating Unit
0,World of Business,1000,1009879,1998-10-01,CASH,REV,USD,880801.75,880801.75,880801.75,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1998-10-31,1998-10-31,NaN,NaN,Vision Operations
1,World of Business,1000,1011118,1998-04-01,CASH,REV,USD,12000000.00,12000000.00,12000000.00,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1999-09-30,1999-09-30,NaN,NaN,Vision Operations
2,World of Business,1000,1011627,1998-06-27,CASH,APP,USD,2000000.00,2000000.00,2000000.00,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,CLEARED,1998-06-01,1998-06-01,NaN,NaN,Vision Operations
3,World of Business,1000,1013500,1998-11-04,CASH,REV,USD,1742.91,1742.91,1742.91,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1998-11-30,1998-11-30,NaN,NaN,Vision Operations
4,World of Business,1000,102222,1997-12-21,CASH,REV,DEM,4062.50,6500.00,6500.00,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1999-09-30,1999-09-30,NaN,NaN,Vision Operations
5,World of Business,1000,12,1998-01-24,CASH,REV,USD,5000.00,5000.00,5000.00,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,900001.0,REVERSED,1999-09-30,1999-09-30,NaN,NaN,Vision Operations
6,World of Business,1000,893745987,1997-12-11,CASH,REV,DEM,6250.00,10000.00,10000.00,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1999-09-30,1999-09-30,NaN,NaN,Vision Operations

In [105]:
## iloc
df.iloc[0:2, 0:3]

       Customer Name  Customer Number  Receipt Number
0  World of Business             1000         1009879
1  World of Business             1000         1011118

In [108]:
## loc
df.loc[0:4, ['Type', 'Amount']]

   Type       Amount
0  CASH    880801.75
1  CASH  12000000.00
2  CASH   2000000.00
3  CASH      1742.91
4  CASH      6500.00

In [109]:
df.head()

,Customer Name,Customer Number,Receipt Number,Receipt Date,Type,Receipt Status,Currency Code,Functional Amount,Amount,Net Amount,Customer Receipt Reference,Payment Type Code,Receipt Class Dsp,Location,Customer Bank Name,Customer Bank Account,Customer Bank Account Num,Customer Bank Branch,Batch Name,State,Posted Date,Gl Posted Date,Activity,Tax Code Source,Operating Unit
0,World of Business,1000,1009879,1998-10-01,CASH,REV,USD,880801.75,880801.75,880801.75,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1998-10-31,1998-10-31,NaN,NaN,Vision Operations
1,World of Business,1000,1011118,1998-04-01,CASH,REV,USD,12000000.00,12000000.00,12000000.00,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1999-09-30,1999-09-30,NaN,NaN,Vision Operations
2,World of Business,1000,1011627,1998-06-27,CASH,APP,USD,2000000.00,2000000.00,2000000.00,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,CLEARED,1998-06-01,1998-06-01,NaN,NaN,Vision Operations
3,World of Business,1000,1013500,1998-11-04,CASH,REV,USD,1742.91,1742.91,1742.91,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1998-11-30,1998-11-30,NaN,NaN,Vision Operations
4,World of Business,1000,102222,1997-12-21,CASH,REV,DEM,4062.50,6500.00,6500.00,NaN,NaN,Manual Receipts - BofA,San Jose (OPS),NaN,NaN,NaN,NaN,NaN,REVERSED,1999-09-30,1999-09-30,NaN,NaN,Vision Operations

In [121]:
df.groupby('Receipt Status')['Amount'].mean().reset_index().sort_values(by='Amount', ascending=False)

  Receipt Status      Amount
1            REV  2150674.11
0            APP  2000000.00